app/api/v1/safe_desk/chores_api.rb

      requires :parent_id, type: String, desc: "Mailer Config Id"
      end
      post do
        chore = Chore.create(params)
---
INSERT INTO "chores" ("task_name", "description", "points", "task_priority", "date_completed", "chores_json", "created_at", "updated_at", "parent_id") VALUES ($1, $2, $3, $4, $5, $6, $7, $8, $9) RETURNING "id"

      requires :id, type: String, desc: "Mailer Config Id"
      end
      put ":id" do
        chore = Chore.find params[:id]
        chore.update(params)
---
SELECT "chores".* FROM "chores" WHERE "chores"."id" = $1 LIMIT $2  [["id", "ca9464e2-a78e-47b7-bb8d-9ece970e0597"], ["LIMIT", 1]]
UPDATE "chores" SET "task_priority" = $1, "updated_at" = $2 WHERE "chores"."id" = $3  [["task_priority", 5], ["updated_at", "2022-10-17 22:17:14.889580"], ["id", "b1838d8e-c969-43b6-9dab-9e12384d18fa"]]

      requires :id, type: String, desc: "Mailer Config Id"
      end
      delete ":id" do
        chore = Chore.find params[:id]
        updated_chore = chore.delete
---
SELECT "chores".* FROM "chores" WHERE "chores"."id" = $1 LIMIT $2  [["id", "ca9464e2-a78e-47b7-bb8d-9ece970e0597"], ["LIMIT", 1]]
DELETE FROM "chores" WHERE "chores"."id" = $1  [["id", "ca9464e2-a78e-47b7-bb8d-9ece970e0597"]]